cad/cfd/hav-captive/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2606                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          controlDict;
}

application     interFoam;

startFrom       startTime;

startTime       0;

stopAt          writeNow;

endTime         3000;

deltaT          1;

writeControl    timeStep;

writeInterval   500;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

functions_unused
{
    forces
    {
        type            forces;
        libs            ( forces );
        patches         ( hull );
        rhoInf          998.8;
        log             on;
        writeControl    timeStep;
        writeInterval   1;
        CofR            ( 2.92954 0 0.2 );
    }
}

functions
{
    forces
    {
        type            forces;
        libs            ( forces );
        writeControl    timeStep;
        writeInterval   25;
        log             yes;
        patches         ( hull );
        rho             rho;
        CofR            ( -0.0405 0 -0.011 );
    }
}


// ************************************************************************* //
