cad/cfd/hav-captive/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }
// Half domain: the hull is cut on its centreplane at y = 0 (midPlane).
// Boat is 1.23 m long, bow at x = -0.84, transom at x = +0.39, waterline z = 0.
scale 1;

vertices
(
    (-2.5 0   -1.8) ( 4.0 0   -1.8) ( 4.0 1.8 -1.8) (-2.5 1.8 -1.8)
    (-2.5 0    0.7) ( 4.0 0    0.7) ( 4.0 1.8  0.7) (-2.5 1.8  0.7)
);

blocks ( hex (0 1 2 3 4 5 6 7) (81 23 31) simpleGrading (1 1 1) );  // ~80 mm cells

boundary
(
    inlet      { type patch;         faces ((0 4 7 3)); }
    outlet     { type patch;         faces ((1 2 6 5)); }
    bottom     { type symmetryPlane; faces ((0 3 2 1)); }
    atmosphere { type patch;         faces ((4 5 6 7)); }
    midPlane   { type symmetryPlane; faces ((0 1 5 4)); }
    side       { type symmetryPlane; faces ((3 7 6 2)); }
);
