cad/cfd/hav-captive/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile { version 2.0; format ascii; class dictionary; object snappyHexMeshDict; }
// Background cells are 80 mm, so level n = 80/2^n mm:
//   level 2 = 20 mm, level 3 = 10 mm, level 4 = 5 mm.
castellatedMesh true;
snap            true;
addLayers       false;   // no prism layers in this first pass — see README

geometry
{
    hull.stl { type triSurfaceMesh; name hull; }

    // Coarse-to-fine boxes around the boat, its wake, and the free surface.
    boxFar  { type searchableBox; min (-2.0  0 -0.50); max ( 3.0 1.2  0.30); }
    boxNear { type searchableBox; min (-1.2  0 -0.25); max ( 1.6 0.7  0.18); }
    boxFS   { type searchableBox; min (-1.2  0 -0.08); max ( 2.2 0.7  0.08); }
}

castellatedMeshControls
{
    maxLocalCells   1000000;
    maxGlobalCells  4000000;
    minRefinementCells 10;
    nCellsBetweenLevels 3;
    resolveFeatureAngle 30;
    allowFreeStandingZoneFaces true;
    locationInMesh (-2.0 0.9 0.5);   // in the air, well clear of the hull
    features ();

    refinementSurfaces
    {
        hull { level (3 4); patchInfo { type wall; } }
    }

    refinementRegions
    {
        boxFar  { mode inside; levels ((1e15 1)); }
        boxNear { mode inside; levels ((1e15 2)); }
        boxFS   { mode inside; levels ((1e15 3)); }  // free surface + wake sheet
    }
}

snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 50;
    nRelaxIter 5;
    nFeatureSnapIter 10;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes true;
    layers {}
    expansionRatio 1.2;
    finalLayerThickness 0.5;
    minThickness 0.1;
    nGrow 0;
    featureAngle 120;
    nRelaxIter 3;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
}

meshQualityControls { #include "meshQualityDict" }
writeFlags ( scalarLevels layerSets layerFields );
mergeTolerance 1e-6;
