cad/cfd/hav-captive/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2606                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          713;
        startFace       168172;
    }
    outlet
    {
        type            patch;
        nFaces          713;
        startFace       168885;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          1863;
        startFace       169598;
    }
    atmosphere
    {
        type            patch;
        nFaces          1863;
        startFace       171461;
    }
    midPlane
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          2511;
        startFace       173324;
    }
    side
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          2511;
        startFace       175835;
    }
)

// ************************************************************************* //
