cad/cfd/hav-captive/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2606                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           volVectorField;
    object          U;
}

Umean           8;

mUmean          -1.668;

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 8 0 0 );

boundaryField
{
    cyclic
    {
        type            cyclic;
    }
    cyclicAMI
    {
        type            cyclicAMI;
        value           uniform ( -1.668 0 0 );
    }
    cyclicACMI
    {
        type            cyclicACMI;
        value           uniform ( -1.668 0 0 );
    }
    cyclicSlip
    {
        type            cyclicSlip;
    }
    empty
    {
        type            empty;
    }
    nonuniformTransformCyclic
    {
        type            nonuniformTransformCyclic;
    }
    processor
    {
        type            processor;
    }
    processorCyclic
    {
        type            processorCyclic;
    }
    symmetryPlane
    {
        type            symmetryPlane;
    }
    symmetry
    {
        type            symmetry;
    }
    wedge
    {
        type            wedge;
    }
    overset
    {
        type            overset;
    }
    inlet
    {
        type            fixedValue;
        value           uniform ( -1.668 0 0 );
    }
    outlet
    {
        type            outletPhaseMeanVelocity;
        alpha           alpha.water;
        Umean           8;
        value           uniform ( -1.668 0 0 );
    }
    atmosphere
    {
        type            pressureInletOutletVelocity;
        value           uniform ( 0 0 0 );
    }
    hull
    {
        type            movingWallVelocity;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
