cad/cfd/hav-captive/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2606                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           volScalarField;
    object          k;
}

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0.24;

boundaryField
{
    cyclic
    {
        type            cyclic;
    }
    cyclicAMI
    {
        type            cyclicAMI;
        value           uniform 0.00015;
    }
    cyclicACMI
    {
        type            cyclicACMI;
        value           uniform 0.00015;
    }
    cyclicSlip
    {
        type            cyclicSlip;
    }
    empty
    {
        type            empty;
    }
    nonuniformTransformCyclic
    {
        type            nonuniformTransformCyclic;
    }
    processor
    {
        type            processor;
    }
    processorCyclic
    {
        type            processorCyclic;
    }
    symmetryPlane
    {
        type            symmetryPlane;
    }
    symmetry
    {
        type            symmetry;
    }
    wedge
    {
        type            wedge;
    }
    overset
    {
        type            overset;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 0.00015;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.00015;
        value           uniform 0.00015;
    }
    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 0.00015;
        value           uniform 0.00015;
    }
    hull
    {
        type            kqRWallFunction;
        value           uniform 0.00015;
    }
}


// ************************************************************************* //
