cad/cfd/hav-captive/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile { version 2.0; format ascii; class dictionary; object setFieldsDict; }
// Air everywhere, then water below z = 0.
defaultFieldValues ( volScalarFieldValue alpha.water 0 );

regions
(
    // Interior cells.
    boxToCell { box (-999 -999 -999) (999 999 0); fieldValues ( volScalarFieldValue alpha.water 1 ); }

    // Boundary FACE values, which is what feeds the inlet. Without this the
    // inlet is alpha = 0 over its whole face and blows air in below the
    // waterline, and the domain slowly drains.
    boxToFace { box (-999 -999 -999) (999 999 0); fieldValues ( volScalarFieldValue alpha.water 1 ); }
);
